app/Controllers/Proveedores.php

SELECT *
FROM `proveedores`
---
    public function index()
    {
        $model = model('Proveedores');
        $data['proveedores'] = $model->find();